# FailToReOrientSketchCurvesFailure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..FailToReOrientSketchCurvesFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Failed to orient sketch curves.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FailToReOrientSketchCurvesFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FailToReOrientSketchCurvesFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FailToReOrientSketchCurvesFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace